[
  {
    "speaker": "김용대, KAIST, 대한민국",
    "title": "Cellular Metasploit: 셀룰러 네트워크를 위한 침투 테스트 프레임워크",
    "abstract": "2025년 4월, 가짜 기지국이 도쿄 상공을 선회하며 휴대폰을 GSM으로 다운그레이드시키고 피싱 SMS 메시지를 전송했습니다. 대중의 항의에도 불구하고 일본 당국의 대응은 느렸으며, 이는 셀룰러 취약점이 악용될 때 전 세계적으로 나타나는 패턴입니다. 이러한 사건은 셀룰러 이중 사용 기술의 전형적인 예입니다: 정부가 운영하는 IMSI 캐처부터 다국적 범죄 조직이 운영하는 SMS 블라스터까지, 감시와 범죄 모두를 가능하게 하는 4G 및 5G의 사양 수준 취약점입니다.\n\n이러한 취약점의 실제 악용 가능성을 입증하기 위해 셀룰러 네트워크를 위한 침투 테스트 프레임워크인 Cellular Metasploit을 제시합니다. 널리 사용되는 Metasploit Framework에서 영감을 받아, (1) 표준 준수 취약점을 활용하는 셀룰러 익스플로잇 모음, (2) 네트워크 정찰을 위한 보조 도구, (3) 공격 페이로드, (4) 사후 분석 기능을 제공합니다. 15년간의 연구를 바탕으로 알려진 공격을 체계적으로 분류하고 구현하며, 오픈소스 프로젝트로 개발 중입니다.\n\n이 발표에서는 프론트 도어 수준의 스마트폰 추적 및 가짜 기지국 설계와 탐지 등 사례 연구를 통해 프레임워크의 기능을 시연합니다. 실제 공격의 광범위한 동영상 시연을 보여주고, 이러한 도구가 표준화 기관과의 투명한 보안 논의를 어떻게 촉진할 수 있는지 논의합니다.",
    "image": "/assets/keynotes/2025/keynote-1.png",
    "biography": "김용대(IEEE Fellow, NAEK 회원)는 KAIST 전기및전자공학부 및 정보보호대학원 교수로, KAIST ICT 석좌교수이자 경찰과학기술연구센터장을 맡고 있습니다. 2002년 서던캘리포니아대학교에서 컴퓨터과학 박사 학위를 받았습니다. 2002년부터 2012년까지 미네소타대학교 트윈시티즈 캠퍼스에서 교수로 재직했습니다. KAIST에서는 석좌교수(2013-2016)와 사이버보안연구센터 소장(2018-2020)을 역임했습니다. NDSS 운영위원회 위원장(2024), ACM WiSec 프로그램 위원장(2022), ACM CCS 총괄 위원장(2021), ACM TOPS 부편집장을 역임했습니다. 그의 연구는 드론, 자율주행 차량, 셀룰러 네트워크 등 신기술의 보안 취약점 발견 및 분석에 중점을 두고 있습니다."
  },
  {
    "speaker": "Christian Esposito, 살레르노 대학교, 이탈리아",
    "title": "미래 네트워크의 이상 탐지를 위한 양자 기술",
    "abstract": "침입 탐지 시스템(IDS)은 현대 네트워크 보안에 필수적이지만, 기존의 머신러닝 기반 이상 탐지 방법은 고차원 및 불균형 데이터에서 어려움을 겪습니다. 고전적 GAN이 데이터 생성 개선에 도움이 되지만, 계산 비용이 많이 들고 확장성이 제한됩니다. 양자 관련 ML 방식이 유망한 대안을 제시하지만, 기존 접근 방식은 시뮬레이션에서만 테스트되었습니다. 실제 장치를 사용하면 양자 노이즈의 영향뿐만 아니라, 더 중요하게는 높은 비용으로 인한 사용 제한 때문에 문제가 발생합니다. 이 발표에서는 IBM 실제 양자 장치와 노이즈 시뮬레이터를 번갈아 사용하는 하이브리드 훈련 접근 방식을 채택하여, 계산적 실현 가능성과 실제 관련성의 균형을 맞추는 경량화되면서도 효과적인 하이브리드 QML 네트워크 침입 탐지 솔루션에 대한 최근 연구를 소개합니다.",
    "image": "/assets/keynotes/2025/keynote-2.png",
    "biography": "Christian Esposito 교수는 현재 2022년 12월부터 살레르노 대학교 부교수로 재직 중입니다. 살레르노 대학교 종신 조교수, 나폴리 \"페데리코 2세\" 대학교 조교수를 역임했으며, 2011년부터 2015년까지 이탈리아 국립연구위원회(CNR)의 고성능 컴퓨팅 및 네트워킹 연구소(ICAR)에서 2년간 연구원 및 단기 연구원으로 활동했습니다. 2006년 컴퓨터공학 학사, 2009년 박사 학위를 이탈리아 나폴리 \"페데리코 2세\" 대학교에서 취득했습니다.\n\n국제 저널 및 학술대회에 약 150편의 논문을 발표했으며, 약 60여 개의 국제 학술대회/워크숍에서 프로그램 위원 또는 조직에 참여했습니다. 분산 시스템 및 의존 가능 시스템 분야의 저널 및 학술대회에서 정기적으로 리뷰어로 활동하고 있습니다. IEEE Access의 부편집장을 역임하고 있으며, 다양한 국제 저널의 특별호에서 게스트 편집장을 역임했습니다. 연구 관심 분야는 측위 시스템, 안정적이고 안전한 통신, 게임 이론 및 다목적 최적화입니다."
  },
  {
    "speaker": "Junji Shikata, 요코하마국립대학교, 일본",
    "title": "포스트 양자 고급 암호 및 B5G 적용",
    "abstract": "고급 암호란 기존 암호 프리미티브에 비해 추가되거나 개선된 기능 또는 새로운 기능 측면에서 우수성을 주장하는 암호 체계를 의미합니다. 예를 들어, ID 기반 암호, 속성 기반 암호, 방송 암호, 동형 암호, 프록시 재암호화가 포함됩니다. 이 발표에서는 예상되는 역할과 사용 사례를 고려하여 포스트 양자 고급 암호와 5G 이상(B5G)에 대한 적용을 설명합니다. 또한, PQC 기반 고급 암호에 대한 일본의 연구 프로젝트와 그 활동을 소개하고 설명합니다.",
    "image": "/assets/keynotes/2025/keynote-3.png",
    "biography": "Junji Shikata 교수는 1994년과 1997년에 교토대학교에서 수학 학사 및 석사 학위를, 2000년에 오사카대학교에서 수학 박사 학위를 취득했습니다. 2000년부터 2002년까지 도쿄대학교 생산기술연구소에서 박사후 연구원을 역임했습니다. 2002년부터 요코하마국립대학교 환경정보과학부에 재직하고 있으며, 현재 교수입니다. 또한 2021년부터 2023년까지 학부장을 역임했으며, 2023년부터 부학장을 맡고 있습니다. 연구 관심 분야는 암호학, 정보 이론, 이론 컴퓨터과학, 계산 수론입니다. 특히 포스트 양자 암호(PQC)와 정보 이론적 암호를 포함한 다양한 관점에서 양자 컴퓨터에 안전한 차세대 암호 기술 개발 연구에 종사하고 있습니다. 2006년 British Computer Society의 Wilkes Award, MobiSec 2024의 Lifetime Achievement Award 등 다수의 상을 수상했습니다."
  }
]
